using System;
using System.IO;

namespace Lab8
{
    public class Second
    {
        /*
        Реализовать алгоритмы КМП, БМ, простого поиска подстроки и проверить
        на различных тестах. Тестовые строки (искомые подстроки) должны быть
        представлены произвольными строками и строками с повторяющимися
        фрагментами. Сравнить эффективность одних тех же алгоритмов для
        разных подстрок. Для каждого алгоритма должны выводиться на консоль
        следующие данные: позиция найденного элемента (или сообщение «Не найдено»),
        время работы алгоритма ( «секунды : миллисекунды» ), количество сравнений.
        */
        public static void Execute()
        {

        }
    }
}
